apache2-k.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Apache/2.2.17
Server Hostname:        localhost
Server Port:            80

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   0.047 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Keep-Alive requests:    100
Total transferred:      31107 bytes
HTML transferred:       1500 bytes
Requests per second:    2138.81 [#/sec] (mean)
Time per request:       4.675 [ms] (mean)
Time per request:       0.468 [ms] (mean, across all concurrent requests)
Transfer rate:          649.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    3   9.2      0      47
Waiting:        0    3   9.2      0      47
Total:          0    3   9.2      0      47

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%     16
  95%     31
  98%     47
  99%     47
 100%     47 (longest request)