apache2-n.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Apache/2.2.17
Server Hostname:        localhost
Server Port:            80

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   0.047 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      27500 bytes
HTML transferred:       1500 bytes
Requests per second:    2138.76 [#/sec] (mean)
Time per request:       4.676 [ms] (mean)
Time per request:       0.468 [ms] (mean, across all concurrent requests)
Transfer rate:          574.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0      16
Processing:     0    4   7.0      0      16
Waiting:        0    4   7.0      0      16
Total:          0    5   7.2      0      16

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%     16
  80%     16
  90%     16
  95%     16
  98%     16
  99%     16
 100%     16 (longest request)