golang1-k.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   0.623 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Keep-Alive requests:    100
Total transferred:      22609 bytes
HTML transferred:       1500 bytes
Requests per second:    160.41 [#/sec] (mean)
Time per request:       62.340 [ms] (mean)
Time per request:       6.234 [ms] (mean, across all concurrent requests)
Transfer rate:          35.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  42.1      0     421
Processing:     0   53 109.6     31     421
Waiting:        0   49 110.8     16     421
Total:          0   58 115.5     31     421

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     31
  75%     31
  80%     31
  90%     31
  95%    421
  98%    421
  99%    421
 100%    421 (longest request)