golang1-n.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   5.439 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      20000 bytes
HTML transferred:       1500 bytes
Requests per second:    18.39 [#/sec] (mean)
Time per request:       543.920 [ms] (mean)
Time per request:       54.392 [ms] (mean, across all concurrent requests)
Transfer rate:          3.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   54 165.3      0     655
Processing:     0  490 247.1    545    1153
Waiting:        0  449 212.9    545     655
Total:          0  544 298.6    545    1200

Percentage of the requests served within a certain time (ms)
  50%    545
  66%    545
  75%    655
  80%    655
  90%   1091
  95%   1091
  98%   1153
  99%   1200
 100%   1200 (longest request)