python-k.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        localhost
Server Port:            8989

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   7.356 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Keep-Alive requests:    0
Total transferred:      20000 bytes
HTML transferred:       1500 bytes
Requests per second:    13.59 [#/sec] (mean)
Time per request:       735.617 [ms] (mean)
Time per request:       73.562 [ms] (mean, across all concurrent requests)
Transfer rate:          2.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   74 184.2      0     623
Processing:     0  657 285.3    530    1138
Waiting:        0  492 138.1    499     623
Total:          0  731 299.3    623    1138

Percentage of the requests served within a certain time (ms)
  50%    623
  66%    935
  75%   1029
  80%   1075
  90%   1122
  95%   1138
  98%   1138
  99%   1138
 100%   1138 (longest request)