python-n.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        localhost
Server Port:            8989

Document Path:          /helloworld.txt
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   6.639 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      20000 bytes
HTML transferred:       1500 bytes
Requests per second:    15.06 [#/sec] (mean)
Time per request:       663.925 [ms] (mean)
Time per request:       66.393 [ms] (mean, across all concurrent requests)
Transfer rate:          2.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   66 172.5      0     639
Processing:     0  587 224.3    514    1153
Waiting:        0  474 141.9    499     655
Total:          0  653 255.6    530    1153

Percentage of the requests served within a certain time (ms)
  50%    530
  66%    639
  75%    935
  80%    997
  90%   1029
  95%   1138
  98%   1153
  99%   1153
 100%   1153 (longest request)